{
  "title": "Backend Infrastructure Engineer",
  "company": "Kapwing",
  "description": "<p>Kapwing turns video editing, traditionally a heavyweight, time consuming workflow, into a joyful, collaborative experience. We believe that we can use technology to augment the video editing and content creation experience, and we've already started on this path with a wide array of templates, AI applications, and new pipelines for combining tooling with the best AI models.&nbsp;</p><p>As a Backend and Infrastructure Engineer, you will play an instrumental role in maintaining our backend video processing services, while optimizing our infrastructure to balance performance with reliability.</p><p>Join us on our journey to democratize creative tools and invent the future stack of video creation.</p><p><strong>Job Responsibilities</strong></p><ul><li>Expand and maintain our cloud video processing services. Solve engineering challenges related to performance, quality, and reliability&nbsp;of video editing.</li><li>Develop infrastructure for&nbsp;distributed computing workloads, maximizing performance while minimizing cost.</li><li>Implement monitoring, alerting, and logging solutions for identifying application performance bottlenecks on a website serving 10 million visitors per month.</li><li>Create a culture of engineering excellence by refining our processes, documentation,&nbsp;and&nbsp;cross-functional systems.</li></ul><p><strong>Job Requirements</strong></p><ul><li>Experience developing production-grade Python applications, emphasizing performance, reliability, and maintainability.</li><li>Familiarity with containerized environments (e.g., Docker, Kubernetes) and modern cloud platforms (e.g., GCP, AWS, Azure).</li><li>Proficiency with application performance monitoring tools such as New Relic, Datadog, or equivalents, and with centralized logging systems such as Graylog or Elasticsearch.</li><li>(Bonus) Experience in video engineering, including tools such as FFmpeg, ImageMagick, and video player or machine vision pipelines.</li><li>(Bonus) Experience developing compute-intensive, asynchronous systems that handle bursty or large-scale workloads.</li></ul><p><strong>Kapwing Culture</strong></p><p>No ego: Theres a lot we wish we could do but don’t have time for. Must have the ability to put the product needs first</p><p>Scrappy: Define and quickly execute on MVPs to test out product hypotheses. Descopes problems to avoid getting lost in the weeds</p><p>Entrepreneurial: Excited about joining a small, high-growth team and contributing across all areas of the company</p><p>Passion for serving creative professionals and interest in media. Our product is fun and we have you to have fun building it too!</p>",
  "id": "10486099"
}