{
  "title": "Backend Engineer",
  "company": "Clerkie",
  "description": "<p><strong>✨ A note before you apply</strong></p><p>We’re hiring <strong>multiple Backend Engineers </strong>across a range of experience levels from Associate to Senior. This listing represents one of several open roles on our Backend team.</p><p>If you're excited about what we're building and aren’t sure if you meet the exact requirements, we still encourage you to apply. We’ll consider your background holistically and match you to the opportunity that best aligns with your strengths.</p><p><strong>About Clerkie</strong></p><p>Clerkie is a fintech startup on a mission to democratize financial wellness using the power of artificial intelligence. Launched in 2018, Clerkie began with an app, aiming to help the nearly 123 million underserved Americans in need of financial guidance. Since its inception, the company has expanded its services and now pairs consumer guidance with cutting-edge B2B software. By pairing the two through the Clerkie network, these tools have become the go-to resource for creditors looking to manage loan losses while simultaneously helping millions of borrowers get out of debt.</p><p>Clerkie is a remote-first company, with over 34 employees spanning 4 time zones across the United States. To date, the company has raised $41 million, including a $33 million Series A round in early 2023. Investors include leading financial and venture institutions, including Citi Ventures, Left Lane Capital, Wellington Ventures, Flourish Ventures, and Vestigo Ventures.</p><p><strong>About the role</strong></p><p>Our success depends on having a reliable, flexible, and scalable system that powers existing and new features. As a Backend Engineer, you'll be responsible for owning and maintaining substantial portions of the backend infrastructure as we scale our user-base and build on our existing product. Our system has been built with security and scalability in mind and we're committed to maintaining and improving our system as we grow.</p><p>The ideal Clerkie team member can pivot on the fly, fight through adversity, communicate effectively, and produce high-quality work on short timelines. Clerkie’s culture values working with a customer-first mindset and bias for action.</p><p><strong>Here’s what you will do</strong></p><ul><li>Be responsible for designing, implementing, and maintaining core infrastructure</li><li>Provide backend expertise to facilitate feature development and improve core platform reliability, performance, and scalability</li><li>Expand our ecosystem of metrics and alerts to improve the user experience</li><li>Work with other members/teams at Clerkie to provide a comprehensive, easy, and reliable user experience</li></ul><p><strong>Minimum qualifications</strong></p><ul><li>Bachelor’s degree in computer science (CS) or a similar technical field of study, or equivalent practical experience</li><li>2+ years of software development experience</li><li>Standalone self-starter able to manage individual project priorities, deadlines and deliverables</li><li>Excellent leadership, communication, and collaboration skills</li><li>Good command of object-oriented programming best practices</li><li>Working proficiency and communication skills in verbal and written English</li></ul><p><strong>Preferred qualifications (ranked by priority and not required):</strong></p><ul><li>4+ years of experience in server-side development</li><li>Experience building server-side applications in Node.js</li><li>Experience with NoSQL databases (e.g., MongoDB)</li><li>AWS and DevOps experience (e.g., using EC2 / S3 / ELB / etc.)</li><li>Experience in FinTech or other data heavy applications (not required)</li></ul><p><strong>Other adds</strong></p><ul><li>Passion for our mission</li><li>Proactive team player who can work with others towards a common goal</li><li>Extreme focus on the user with a healthy obsession for solving their needs</li><li>Committed to being a part of something bigger than yourself</li><li>Excitement for being a part of a small team where you will be expected to solve new challenges and learn new things everyday</li></ul><p><strong>Our salary range</strong></p><ul><li>$90k - $150k (+ equity)&nbsp;</li></ul><p><strong>Our Benefits</strong></p><ul><li>Medical, dental, and vision insurance</li><li>401k &amp; retirement benefits</li><li>Paid time off and holidays</li><li>Annual company retreat</li></ul><p><strong>Our Process</strong></p><p>Our hiring process is intentionally designed for you to interview Clerkie as much as our team is interviewing you. We've built a 5-step process that allows for a two-way assessment across skills, behaviors, values, technical ability, ways of working, and adaptability in a lean startup environment.&nbsp;</p><ul><li><strong>Application &amp; Coderbyte </strong>(async candidate time)&nbsp;</li><li><strong>Recruiting Screen w/ Head of People </strong>(20-30 minutes via Google meet)</li><li><strong>Take-Home Challenge &amp; Live Review w/ Sr. Engineer</strong> (challenge is async candidate time, live review is 45 mins via Google meet)&nbsp;</li><li><strong>Live Coding Challenge w/ Sr. Engineer</strong> (90 minutes via Google meet)&nbsp;</li><li><strong>Final Management Meeting w/ SLT&nbsp;</strong>(45 minutes via Google meet)</li></ul><p>Before we extend any offers, all candidates must successfully complete a standard background check in addition to a reference check. These checks are conducted in tandem to ensure a safe, secure, and compliant environment for all Clerkie team members and stakeholders. We approach this stage with transparency and sensitivity, and candidates will be provided with clear information about the process.</p><p>Applicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time.</p>",
  "id": "10471200"
}