{
  "title": "Data Science Intern",
  "company": "Tekmir",
  "description": "<p>We’re looking for a <strong>Part-time</strong> <strong>Data Science Intern</strong> who’s excited to work at the intersection of data, technology, and product strategy. Join us on our mission to redefine how legal teams use data to deliver better outcomes for their clients.</p><p>&nbsp;<strong>You will...</strong></p><ul><li>Build and iterate on predictive and statistical models (Python, SQL, Snowpark) that power our analytics engines.</li><li>Design, test, and document dbt models &amp; semantic layers that feed dashboards and downstream AI services.</li><li>Develop and maintain analytics pipelines using Airbyte, dbt, and Snowflake—owning data-quality checks and alerting.</li><li>Prototype ML workflows and package them for production hand-off.</li><li>Create dashboards and exploratory notebooks to surface trends, validate assumptions, and tell compelling data stories to lawyers and product stakeholders.</li><li>Collaborate with engineers &amp; analysts to translate legal-domain questions into rigorous experiments and measurable KPIs.</li><li>Present findings in sprint reviews and written briefs, clearly explaining statistical assumptions, model trade-offs, and business impact.</li></ul><p><strong>You are...</strong></p><ul><li>Pursuing a B.S. or M.S. in Data Science, Statistics, Computer Science, or a related quantitative field.</li><li>Able to join full-time Summer 2026.</li><li>Proficient in Python and SQL.</li><li>Familiar with basic ML concepts (regression, classification, cross-validation) and statistical inference.</li><li>Detail-oriented, analytical, and curious about how data drives real-world decisions.</li><li>A clear communicator who can translate model output into concise, actionable recommendations for non-technical stakeholders.</li><li>Collaborative, self-directed, and eager to learn new tools quickly.</li></ul><p><strong>You’ll Stand Out If You Are...</strong></p><ul><li>Maintaining a GPA of 3.5 or higher.</li><li>Have hands-on experience with dbt, Airbyte, or Snowflake.</li><li>Know your way around AWS or GCP, Docker, and CI/CD workflows.</li><li>Have built dashboards in Hex or Tableau that real users rely on.</li></ul><p><strong>What You Can Expect…</strong></p><ul><li>Mentorship from seasoned data scientists and engineers.</li><li>Ownership of real modeling and analytics projects—from discovery to deployment.</li><li>A chance to shape the data foundation of a rapidly growing legal-tech platform.</li><li>Fast feedback loops with founders, product, and operations teams.</li></ul><p><strong>Why You’ll Love Working Here</strong></p><ul><li>A remote-first, flexible internship that supports how you work best.</li><li>Meaningful work helping law firms make smarter, data-informed decisions.</li><li>A tight-knit, supportive team that values learning, ownership, and curiosity.</li><li>Potential to join Tekmir full-time in Pittsburgh after graduation and continue growing with us.</li></ul>",
  "id": "10481851"
}