{
  "title": "Developer",
  "company": "Jack",
  "description": "<p>Join Jack, the platform transforming the way people land their next career opportunity. The company is seeking a Developer to build and scale features that make job searching smarter, faster, and more seamless. You’ll work closely with product and design teams to bring innovative ideas to life, solve complex technical challenges, and help shape the future of the platform. Ideal candidates are passionate about building high-quality, user-focused products and thrive in a fast-paced startup environment.&nbsp;<br><br><br><br>Benefits&nbsp;<br>- Competitive salary and performance-based bonuses&nbsp;<br>- Flexible work arrangements, including remote-friendly options&nbsp;<br>- Opportunities for professional growth, mentorship, and skill development&nbsp;<br>- Collaborative, inclusive culture with a focus on innovation&nbsp;<br><br><br>Responsibilities&nbsp;<br>- Develop, test, and maintain web and mobile applications&nbsp;<br>- Collaborate with product designers and managers to implement user-focused features&nbsp;<br>- Optimize applications for performance, scalability, and security&nbsp;<br>- Troubleshoot, debug, and improve existing codebase&nbsp;<br>- Participate in code reviews and contribute to a high-quality engineering culture&nbsp;<br>- Stay up-to-date with emerging technologies and industry trends&nbsp;<br><br>Requirements&nbsp;<br>- 2+ years of professional experience in software development&nbsp;<br>- Strong knowledge of modern web development technologies (JavaScript, React, Node.js, etc.) - Experience with APIs, databases, and cloud services&nbsp;<br>- Understanding of best practices for performance, scalability, and security&nbsp;<br>- Strong problem-solving skills and attention to detail&nbsp;<br>- Ability to work in a fast-paced, collaborative startup environment&nbsp;<br>- Experience with agile methodologies is a plus&nbsp;<br><br><br>Equal Opportunity Statement&nbsp;<br>We are committed to diversity and inclusivity in our hiring practices.</p>",
  "id": "10478961"
}