{
  "title": "DevOps Engineer",
  "company": "Sain Technologies",
  "description": "<p><strong>Job Title:</strong> DevOps Engineer (AWS)<br><strong>Location:</strong> Texas (Onsite/Hybrid/)<br><strong>Duration:</strong> Full-time</p><p><strong>Job Description:</strong></p><p>We are seeking a highly skilled <strong>DevOps Engineer</strong> with strong experience in <strong>AWS cloud infrastructure</strong> to join our team supporting <strong>Swift</strong> in Texas. The ideal candidate will have hands-on expertise in designing, implementing, and maintaining CI/CD pipelines, automating infrastructure, and ensuring high availability and scalability across environments.</p><p><strong>Responsibilities:</strong></p><p>Design, implement, and manage <strong>AWS-based cloud infrastructure</strong>.</p><p>Build and maintain <strong>CI/CD pipelines</strong> for continuous integration and deployment.</p><p>Automate infrastructure provisioning using <strong>Terraform, CloudFormation, or similar tools</strong>.</p><p>Monitor system performance and troubleshoot issues proactively.</p><p>Collaborate with development and operations teams to optimize workflows and improve deployment efficiency.</p><p>Implement security best practices, monitoring, and logging across cloud and application environments.</p><p>Manage configuration and version control using <strong>Git, GitHub, or Bitbucket</strong>.</p><p><strong>Required Skills:</strong></p><p>5+ years of experience as a <strong>DevOps Engineer</strong>.</p><p>Strong hands-on experience with <strong>AWS services</strong> (EC2, S3, Lambda, CloudWatch, ECS, etc.).</p><p>Experience with <strong>Docker</strong> and <strong>Kubernetes</strong> for container orchestration.</p><p>Proficiency in <strong>CI/CD tools</strong> such as Jenkins, GitLab CI, or AWS CodePipeline.</p><p>Expertise in <strong>Infrastructure as Code (IaC)</strong> tools such as Terraform or CloudFormation.</p><p>Strong scripting skills in <strong>Python, Bash, or PowerShell</strong>.</p><p>Knowledge of monitoring and logging tools like <strong>Prometheus, Grafana, or ELK Stack</strong>.</p><p>Excellent communication and problem-solving skills.</p><p><strong>Preferred Skills:</strong></p><p>AWS Certifications (e.g., <strong>AWS Certified DevOps Engineer</strong>, <strong>AWS Solutions Architect</strong>)</p><p>Experience with <strong>security and compliance automation</strong>.</p><p>Familiarity with <strong>Agile/Scrum methodologies</strong>.</p>",
  "id": "10500608"
}