{
  "title": "Full Stack Developer",
  "company": "Technology Solutions Provider, Inc. (TSPi)",
  "description": "<p>TSPi seeks a Java Full Stack Developer in Reston, VA.</p><p>&nbsp;</p><p>Duties:&nbsp;</p><p>• Front-End Development: Develop and implement user interfaces using HTML, CSS, and JavaScript, ensuring cross-browser compatibility and responsiveness.</p><p>• UI/UX Collaboration: Collaborate with UI/UX designers to implement design mockups, wireframes, and prototypes into functional front-end code.</p><p>• Responsive Design: Ensure that web applications are responsive and accessible across various devices and screen sizes.</p><p>• Web Performance: Optimize front-end code and assets to improve page load times and overall performance.</p><p>• Cross-Functional Collaboration: Work closely with back-end developers to integrate front-end and back-end components seamlessly.</p><p>• Version Control: Use version control systems (e.g., Git) to manage and track changes to front-end code.</p><p>• Debugging and Troubleshooting: Identify and resolve front-end issues, such as layout problems, browser compatibility, and performance bottlenecks.</p><p>• Code Reviews: Participate in code reviews to ensure code quality, consistency, and adherence to coding standards.</p><p>• Communication: Effectively communicate technical concepts and challenges to both technical and non-technical team members.</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p><p>Requires a Master’s degree in Computer Science, Software Engineering, or related field (or foreign equivalent) and 4 years of experience in related occupations.&nbsp;</p><p>&nbsp;</p><p>Requires 1 year of experience with the following: writing safe, efficient, and effective C++ code and understanding programming patterns with C++; distributed and multi-threaded systems; writing software</p><p>that performs both correctly and efficiently when deployed to a cluster of computers; working with Linux/Unix systems and understanding the low-level functionality of Unix kernel; working with software development lifecycle, such as designing, developing, testing and releasing software; and building core components for data processing systems.&nbsp;</p><p>&nbsp;</p><p>Requires a Bachelor’s degree in Computer Science, Computer Engineering or a closely related field (or foreign equivalent), plus 1 year of experience.</p><p>&nbsp;</p><p>Requires 1 year of experience in the following:</p><p>• Esri ArcGIS</p><p>• SAFe methodology</p><p>• Pega</p><p>• Java</p><p>• Angular JS</p><p>&nbsp;</p><p>Requires 3 months training with SAFe.</p><p>Telecommuting permitted.</p><p>40 hours/week, $101,421 per year. Must also have authority to work permanently in the U.S. Applicants who are interested in this position may apply at <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.jobpostingtoday.com/\">https://www.jobpostingtoday.com/</a> Ref # 89236. &nbsp;&nbsp;</p><p>&nbsp;Any individual may provide documentary evidence bearing on this application, with information on available workers and information on wages and working conditions, to the Certifying Officer: &nbsp;&nbsp;</p><p>&nbsp;</p><p>U.S. Department of Labor</p><p>Employment and Training Administration</p><p>Office of Foreign Labor Certification</p><p>200 Constitution Avenue NW</p><p>Room N-5311</p><p>Washington, DC 20210</p><p>Phone: (404) 893-0101</p><p>Fax: (404) 893-4644</p>",
  "id": "10501153"
}