{
  "title": "Full-Stack Engineer",
  "company": "Clerkie",
  "description": "<p>✨ <strong>A note before you apply&nbsp;</strong></p><p>We’re hiring <strong>multiple Full-Stack Engineers&nbsp;</strong>across a range of experience levels from Associate to Senior. This listing represents one of several open roles on our Product Engineering team.</p><p>If you're excited about what we're building and aren’t sure if you meet the exact requirements, we still encourage you to apply. We’ll consider your background holistically and match you to the opportunity that best aligns with your strengths.</p><p><strong>About Clerkie</strong></p><p>Clerkie is a fintech startup on a mission to democratize financial wellness using the power of artificial intelligence. Launched in 2018, Clerkie began with an app, aiming to help the nearly 123 million underserved Americans in need of financial guidance. Since its inception, the company has expanded its services and now pairs consumer guidance with cutting-edge B2B software. By pairing the two through the Clerkie network, these tools have become the go-to resource for creditors looking to manage loan losses while simultaneously helping millions of borrowers get out of debt.</p><p>Clerkie is a remote-first company, with over 30 employees spanning 4 time zones across the United States. To date, the company has raised $41 million, including a $33 million Series A round in early 2023. Investors include leading financial and venture institutions, including Citi Ventures, Left Lane Capital, Wellington Ventures, Flourish Ventures, and Vestigo Ventures.</p><p><strong>About the role</strong></p><p>As the newest addition to team Clerkie across our Engineering function, this Full-Stack Engineer will play a key role in developing Clerkie Fiber, our B2B CRM designed to transform the debt industry. We're looking for engineers who thrive in a fast-paced environment, love problem-solving, and take pride in delivering high-quality work. You’ll work across the stack, collaborating with both frontend and backend engineers to develop scalable and intuitive products. Whether you're optimizing APIs, designing intuitive user interfaces, or ensuring smooth system performance, your work will directly impact both businesses and consumers using Clerkie’s technology. The ideal Clerkie team member can pivot on the fly, fight through adversity, communicate effectively, and produce high-quality work on short timelines. Clerkie’s culture values a customer-first mindset and a bias for action.</p><p><strong>Here’s what you will do</strong></p><ul><li>Develop and maintain Clerkie Fiber, our flagship B2B CRM, collaborating closely with backend, frontend, product, and design teams</li><li>Work across the full tech stack, from frontend interfaces (Next.js, Tailwind CSS) to backend services (Node.js, AWS, MongoDB)</li><li>Build robust and scalable APIs to support our platform’s growing user base</li><li>Optimize performance and ensure a seamless, user-friendly experience</li><li>Write clean, well-structured, and maintainable code with a strong emphasis on scalability and security</li><li>Contribute to system architecture decisions, helping shape the future of Clerkie’s technology</li></ul><p><strong>Minimum qualifications</strong></p><ul><li>Professional software development experience in full-stack engineering</li><li>Experience with front end development</li><li>Experience with backend development</li><li>Experience with Node.js and backend API development</li><li>Proficiency in JavaScript/TypeScript</li><li>Experience working with databases (SQL or NoSQL, e.g., MongoDB)</li><li>Ability to manage project priorities, meet deadlines, and deliver results independently</li><li>Excitement for being a part of a small team where every day brings new challenges and opportunities to learn and grow</li></ul><p><strong>Preferred qualifications (ranked by priority and not required):</strong></p><ul><li>Professional experience in fullstack development</li><li>Excellent leadership, communication, and collaboration skills</li><li>Strong proficiency in React.js and Next.js</li><li>Strong proficiency in Node.js and backend API development</li><li>Experience designing and consuming RESTful APIs</li><li>Proficiency with AWS and DevOps tools (EC2, S3, Lambda, ELB, etc.)</li><li>Experience with testing frameworks (e.g., Mocha, Jest)</li><li>Background in fintech, consumer finance, or data-heavy applications</li></ul><p><strong>Other adds</strong></p><ul><li>Passion for our mission</li><li>Experience building and scaling products</li><li>Proactive team player who can work with others towards a common goal</li><li>Extreme focus on the user with a healthy obsession for solving their needs</li><li>Committed to being a part of something bigger than yourself</li></ul><p><strong>Our salary range</strong></p><ul><li>$90k - $150k (+ equity)&nbsp;</li></ul><p><strong>Our Benefits</strong></p><ul><li>Medical, dental, and vision insurance</li><li>401k &amp; retirement benefits</li><li>Paid time off and holidays</li><li>Annual company retreat</li></ul><p><strong>Our Process</strong></p><p>Our hiring process is intentionally designed for you to interview Clerkie as much as our team is interviewing you. We've built a 5-step process that allows for a two-way assessment across skills, behaviors, values, technical ability, ways of working, and adaptability in a lean startup environment.&nbsp;</p><ul><li><strong>Application &amp; Coderbyte </strong>(async candidate time)&nbsp;</li><li><strong>Recruiting Screen w/ Head of People</strong> (20-30 minutes via Google meet)</li><li><strong>Take-Home Challenge &amp; Live Review w/ Sr. Engineer</strong> (challenge is async candidate time, live review is 45 mins via Google meet)&nbsp;</li><li><strong>Live Coding Challenge w/ another Sr. Engineer</strong> (90 minutes via Google meet)&nbsp;</li><li><strong>Final Management Meeting w/ an Executive </strong>(45 minutes via Google meet)</li></ul><p>Before we extend any offers, all candidates must successfully complete a standard background check in addition to a reference check. These checks are conducted in tandem to ensure a safe, secure, and compliant environment for all Clerkie team members and stakeholders. We approach this stage with transparency and sensitivity, and candidates will be provided with clear information about the process.</p><p>Applicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time.</p>",
  "id": "10471232"
}