{
  "title": "Job Title: Computer Software Support Specialist",
  "company": "Two Point",
  "description": "<p><strong>Job Title: Computer Software Support Specialist</strong></p><p><strong>Company: Two Point Conversions, Inc.</strong></p><p><strong>Location: Fully Remote</strong></p><p><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"http://www.twopoint.com/\">www.twopoint.com</a></p><p><strong>About Us:</strong></p><p>Two Point Conversions, Inc. is the industry leader in pharmacy data conversion, migration, archiving, and warehousing. We help healthcare organizations transition critical pharmacy data with precision, security, and reliability.</p><p><strong>Position Overview:</strong></p><p>We are seeking a talented <strong>Computer Software Support Specialist</strong> to join our growing remote team. This individual will play a key role in installing, supporting, and maintaining our pharmacy archive applications in both our hosted cloud environment and clients’ local networks.</p><p>This team member will be responsible for installing pharmacy archive applications, monitoring automated tasks, and performing various duties to assist the engineering and operations staff.&nbsp;</p><p><strong>Responsibilities:</strong></p><ul><li>Install and configure pharmacy archive and data conversion applications in cloud and client environments.</li><li>Monitor automated tasks and processes to ensure successful completion.</li><li>Set up data conversion environments on in-network client servers.</li><li>Perform data conversions for pharmacy images between various legacy software systems.</li><li>Perform advanced database queries to support data analysis and validation.</li><li>Upgrade and maintain data maps and schemas to ensure accurate database loading.</li><li>Provide customer support by receiving, reproducing, and resolving defect reports.</li><li>Apply documented fixes and escalate complex issues as needed.</li><li>Code, test and troubleshoot programs utilizing the appropriate hardware, database, and programming technology.&nbsp;</li><li>Analyze performance of programs and take action to correct deficiencies.</li><li>Sustain confidentiality with regard to information being processed, stored or accessed.</li><li>Collaborate with engineering staff to support ongoing projects and resolve technical issues.</li><li>Develop and maintain automation scripts to streamline operational processes.</li></ul><p>&nbsp;</p><p><strong>Qualifications:</strong></p><p>&nbsp;</p><ul><li>Bachelor’s in Computer Science or equivalent is required.</li><li>Proficiency in working across multiple operating systems, including Windows, Linux, and Unix.</li><li>Advanced experience with relational database management systems, preferably Microsoft SQL Server, ORACLE, or MySQL.&nbsp;</li><li>Coding and scripting experience in PERL, bash and/or batch, or similar language(s).&nbsp;</li><li>Strong aptitude for implementing, testing, and troubleshooting programming changes and system modifications.</li><li>Excellent analytical skills with the ability to research issues, interpret data, and draw sound conclusions.</li><li>Demonstrated capacity to quickly learn, adapt to, and support new systems and applications.</li><li>Strong organizational skills with the ability to manage and prioritize multiple tasks effectively.</li><li>Excellent written and verbal communication skills.</li><li>Demonstrated ability to provide professional, customer-focused support in a positive manner.</li><li>Self-motivated with the ability to work independently and efficiently in a remote environment.&nbsp;</li></ul>",
  "id": "10513513"
}