{
  "title": "Junior Developer",
  "company": "Wired Works LLC",
  "description": "<p>Wired Works is a U.S.-based <strong>IT consulting and software agency</strong> specializing in <strong>full-stack web and SaaS application development</strong>.<br>We help startups and established companies design, build, and scale modern software solutions — from custom web apps to automation integrations and digital products.</p><p>Our small, talented team values <strong>clean code, creative problem-solving, and practical innovation</strong>. We believe in empowering our developers to learn, grow, and take ownership of their work.</p><p>&nbsp;</p><p>About the Role:</p><p>We’re looking for a <strong>motivated Junior Developer</strong> who’s eager to gain real-world experience in modern web development and software engineering.<br>You’ll work closely with our senior engineers on active client projects, contributing to front-end and back-end development, integrations, and automation tasks.</p><p>This position is ideal for <strong>computer science students</strong>, <strong>bootcamp graduates</strong>, or <strong>junior developers</strong> looking to grow their skills in a professional environment.</p><p>&nbsp;</p><p><strong>What You’ll Do</strong></p><p>&nbsp;- Assist in building and maintaining web and SaaS applications.</p><p>&nbsp;- Work on front-end (React, Next.js, or similar) and/or back-end (Node.js, Express, Python, etc.) projects.</p><p>&nbsp;- Collaborate on database integrations (PostgreSQL, Supabase, Firebase, etc.).</p><p>&nbsp;- Help design and test APIs, automation flows, and third-party integrations.</p><p>&nbsp;- Participate in code reviews, stand-ups, and project planning sessions.</p><p>&nbsp;- Learn and apply software development best practices.</p><p>&nbsp;</p><p><strong>What We’re Looking For</strong></p><p>&nbsp;- Basic understanding of <strong>JavaScript</strong>, <strong>HTML/CSS</strong>, and at least one framework (React, Vue, or similar).</p><p>&nbsp;- Familiarity with <strong>Node.js</strong>, <strong>Python</strong>, or any back-end language is a plus.</p><p>&nbsp;- Interest in APIs, databases, or automation tools (like HubSpot, Zapier, or Make.com).</p><p>&nbsp;- Strong problem-solving mindset and willingness to learn.</p><p>&nbsp;- Good communication and collaboration skills.</p><p>&nbsp;- Currently pursuing or recently completed a degree in Computer Science, Software Engineering, or related field.</p><p>&nbsp;</p><p><strong>Nice to Have</strong></p><p>&nbsp;- Experience with Git/GitHub version control.</p><p>&nbsp;- Exposure to cloud platforms (AWS, Vercel, or similar).</p><p>&nbsp;- Interest in UI/UX or web design fundamentals.</p><p>&nbsp;- Previous internship, freelance, or project experience.</p><p>&nbsp;</p><p><strong>Why Join Wired Works</strong></p><p>&nbsp;- Gain <strong>hands-on experience</strong> in real client projects.</p><p>&nbsp;- Work alongside <strong>experienced developers and designers</strong>.</p><p>&nbsp;- Learn how professional agencies manage and deliver software solutions.</p><p>&nbsp;- Flexible, remote-first culture with growth opportunities.</p><p>&nbsp;- Potential for long-term employment after internship.</p>",
  "id": "10471283"
}