{
  "title": "Junior Software Developer",
  "company": "Mirae Asset Securities (USA) Inc.",
  "description": "<p style=\"text-align:justify;\"><strong>Junior/Entry-Level Software Developer</strong></p><p style=\"text-align:justify;\">Ideal candidate will be highly motivated with an interest in the financial services industry and maintains a strong passion for coding. This individual will also have a solid foundation in root programming practices. The right candidate will be prepared to both code new projects as well as support legacy processes. They should demonstrate self-motivation to take on new challenges and show ownership to fulfill obligations while gaining the knowledge needed to become a productive member of the team.</p><p style=\"text-align:justify;\">The right individual will become part of a highly productive, tight-knit team. They will quickly gain hands on experience with a variety of technologies and will be exposed to broad ideas and information related to the firm’s business. This position is ideal for someone with a broad skillset, desires visibility and greater impact on providing solutions, and wants to successfully contribute to the growth of a business.</p><p style=\"text-align:justify;\">&nbsp;</p><p style=\"text-align:justify;\"><strong>Responsibilities</strong></p><p style=\"text-align:justify;\">Develop and support applications throughout the full SDLC</p><p style=\"text-align:justify;\">Continuous support of processes built by yourself and other team members</p><p style=\"text-align:justify;\">Ability to document processes and business concepts</p><p style=\"text-align:justify;\">Work effectively both independently and within a team</p><p style=\"text-align:justify;\">Work nonstandard hours and days when required(preferably an early riser)</p><p style=\"text-align:justify;\">&nbsp;</p><p style=\"text-align:justify;\"><strong>Minimum Requirements</strong></p><p style=\"text-align:justify;\">Bachelor's degree in computer science, related discipline, or equivalent work experience.</p><p style=\"text-align:justify;\">1 year continuous experience.&nbsp;</p><p style=\"text-align:justify;\">*We would consider coop work and strong internships as experience for someone who has the proper level of understanding or working in a corporate environment.</p><p style=\"text-align:justify;\">&nbsp;</p><p style=\"text-align:justify;\"><strong>Preferred Qualifications</strong></p><p style=\"text-align:justify;\">C#</p><p style=\"text-align:justify;\">SQL</p><p style=\"text-align:justify;\">Understanding of Design Patterns</p><p style=\"text-align:justify;\">Understanding of Microservice Based Architecture</p>",
  "id": "10478406"
}