{
  "title": "Junior Software Engineer",
  "company": "The DYO Inc.",
  "description": "<p><strong>Junior Software Engineer</strong></p><p><strong>About the Role</strong></p><p>We're looking for a Junior Software Engineer to join our team and contribute to an exciting project that combines modern web technologies with 3D visualization and e-commerce capabilities.</p><p><strong>Technical Stack</strong></p><p>You'll be working with:</p><ul><li><strong>Frontend + Serverless backend</strong>: React Remix framework deployed on Vercel serverless infrastructure</li><li><strong>Backend Services</strong>: AWS Lambda functions, DynamoDB for database operations, S3 for storage, and CloudFront for content delivery</li><li><strong>Languages</strong>: Mix of TypeScript and JavaScript</li><li><strong>3D Rendering</strong>: BabylonJS for creating interactive 3D experiences</li><li><strong>E-commerce</strong>: Shopify backend integration</li></ul><p><strong>What We're Looking For</strong></p><p>We're seeking someone who is eager to learn and grow with our technology stack.&nbsp;<strong>If you have relevant experience with any of these technologies, that's great</strong> – but we're equally interested in candidates who demonstrate strong foundational programming skills and enthusiasm for learning.</p><p><strong>Key Qualifications:</strong></p><ul><li>Basic understanding of modern JavaScript/TypeScript and web development principles</li><li>Familiarity with React or similar component-based frameworks</li><li>Understanding of REST APIs and asynchronous programming</li><li>Ability to read documentation and learn new technologies independently</li><li>Strong problem-solving skills and attention to detail</li><li>Good communication skills and ability to work collaboratively</li></ul><p><strong>Bonus Points For:</strong></p><ul><li>Experience with any part of our tech stack (Remix, AWS services, BabylonJS, Shopify APIs)</li><li>Understanding of serverless architecture concepts</li><li>Exposure to 3D graphics or WebGL</li><li>Previous work with e-commerce platforms or payment systems</li><li>Contributions to open-source projects or personal projects you can share</li></ul><p><strong>What You'll Do</strong></p><ul><li>Develop and maintain features across our full-stack application</li><li>Work with 3D visualizations and interactive user experiences</li><li>Integrate e-commerce functionality with our Shopify backend</li><li>Collaborate with senior engineers to implement best practices</li><li>Write clean, maintainable code with appropriate documentation</li><li>Participate in code reviews and team knowledge-sharing</li></ul><p><strong>What We Offer</strong></p><ul><li>Mentorship from experienced engineers</li><li>Opportunity to work with cutting-edge technologies</li><li>Hands-on experience with cloud infrastructure and modern development practices</li><li>Collaborative team environment focused on growth and learning</li></ul><p>We believe in investing in talent and providing the support needed to succeed. If you're passionate about software development and excited about this technology stack, we'd love to hear from you.</p>",
  "id": "10493401"
}