{
  "title": "Junior Full-Stack Developer",
  "company": "IronClad Consulting Services, LLC (Technology Team)",
  "description": "<p><strong>Company:</strong> IronClad Consulting Services<br><strong>Location:</strong> Remote<br><strong>Type:</strong> Contract or Full-Time</p><p><strong>About IronClad Consulting Services</strong></p><p>At IronClad Consulting Services, we partner with early-stage and high-growth companies that need expert financial leadership without committing to a full-time team. We offer tailored fractional finance solutions—whether you need CFO, controller or accounting support—to help you build consistent, scalable financial practices, leverage data for sound decisions and stay ready for fundraising or audits.</p><p>Our specialty lies in startups and growth-oriented businesses, especially in the CPG (consumer packaged goods) sector. We combine strategic planning, process improvement and technology integration to drive financial clarity and operational efficiency.</p><p>Led by seasoned professionals with deep experience in finance, accounting and operations, we become a trusted extension of your team. We focus on delivering measurable results while giving you the flexibility and expertise to grow smarter and stronger.</p><p><strong>The Role</strong></p><p>IronClad is looking for a&nbsp;<strong>Jr Full-Stack Developer</strong> to help us build secure, scalable software from the ground up. You’ll be working across the entire stack—translating Figma designs into responsive interfaces and developing robust back-end systems that meet SOC 2 compliance standards.</p><p>We’re a small, collaborative team focused on quality, speed, and clean architecture. This role is ideal for someone who thrives in a hands-on environment and enjoys solving complex problems through smart design and solid engineering.</p><p><strong>Responsibilities</strong></p><ul><li>Develop and maintain full-stack applications using&nbsp;<strong>React</strong>,&nbsp;<strong>Node.js</strong>, and modern JavaScript frameworks<br>&nbsp;</li><li>Implement database structures with&nbsp;<strong>PostgreSQL</strong>,&nbsp;<strong>SQLite</strong>, and managed services like&nbsp;<strong>AWS DynamoDB</strong> or&nbsp;<strong>Cloudflare D1</strong><br>&nbsp;</li><li>Create and maintain&nbsp;<strong>CI/CD workflows</strong> with&nbsp;<strong>GitHub Actions</strong>,&nbsp;<strong>Vercel</strong>, and other deployment platforms<br>&nbsp;</li><li>Collaborate closely with designers to bring&nbsp;<strong>Figma prototypes</strong> to production-ready UI<br>&nbsp;</li><li>Ensure systems follow&nbsp;<strong>security best practices</strong> and meet&nbsp;<strong>SOC 2 compliance</strong> standards<br>&nbsp;</li><li>Contribute to system architecture, code reviews, and API development<br><br>&nbsp;</li></ul><p><strong>Requirements</strong></p><ul><li>Proficiency in&nbsp;<strong>React</strong>,&nbsp;<strong>Node.js</strong>, and&nbsp;<strong>JavaScript/TypeScript</strong><br>&nbsp;</li><li>Experience with&nbsp;<strong>SQL</strong> and&nbsp;<strong>NoSQL</strong> databases<br>&nbsp;</li><li>Familiarity with&nbsp;<strong>AWS</strong>,&nbsp;<strong>Cloudflare</strong>, or similar hosting environments<br>&nbsp;</li><li>Understanding of&nbsp;<strong>authentication</strong>,&nbsp;<strong>authorization</strong>, and&nbsp;<strong>secure API design</strong><br>&nbsp;</li><li>Comfortable working with&nbsp;<strong>GitHub-based workflows</strong> and&nbsp;<strong>CI/CD pipelines</strong><br>&nbsp;</li><li><strong>Figma experience</strong> is highly recommended<br><br>&nbsp;</li></ul><p><strong>Nice to Have</strong></p><ul><li>Experience with&nbsp;<strong>infrastructure-as-code</strong> tools<br><br>&nbsp;</li><li>Familiarity with&nbsp;<strong>SOC 2</strong> or related compliance frameworks<br><br>&nbsp;</li><li>Previous experience contributing to&nbsp;<strong>small, agile teams</strong><br><br>&nbsp;</li><li>Experience with business processes and accounting<br><br>&nbsp;</li></ul><p><strong>Additional Info</strong></p><p>We’re also open to onboarding&nbsp;<strong>front-end developers</strong> who can grow into a full-stack role. Strong design translation and collaboration skills will be key.</p><p><br>&nbsp;</p>",
  "id": "10470576"
}