{
  "title": "Junior Software Engineer Intern",
  "company": "CENTRL Inc",
  "description": "<p>CENTRL is a leading risk and compliance technology company that provides AI powered enterprise-grade risk, due diligence, cyber security and privacy management solutions to financial institutions worldwide. Our clients include some of the largest banks and investment management firms across the Americas, Europe and APAC. Headquartered in Silicon Valley, CENTRL has regional offices in New York, India, Australia, and the United Kingdom. Established in 2015, CENTRL is a high-growth, venture backed SaaS firm leading the way in innovative generative AI solutions to manage third party risk and due diligence.<br><br>&nbsp;</p><p><strong>Position Overview:</strong></p><p>Looking for a Junior Software Engineer Intern to join our Client Services Technical Solutions team supporting the Enterprise B2B SaaS platform.</p><p>This internship has a minimum 4 months duration and can extend up to&nbsp; 6 months.</p><p>&nbsp;Our paid internship program is ideal for recent computer science graduates and provides an opportunity to gain practical experience with current software development techniques and train under experienced professionals in the software development field.&nbsp;</p><p>The intern will work closely with our product development team to handle support escalations, troubleshoot client issues,&nbsp; identify solutions for issues on our customer’s behalf, and provide fixes as necessary. &nbsp;</p><p>The ideal candidate will convert to a full-time employee upon a successful internship.<br><br>&nbsp;</p><p><strong>Job Responsibilities</strong></p><ul><li>Maintain and support our enterprise products/solutions, troubleshooting issues and providing code fixes for client-reported issues.</li><li>Perform coding, maintenance of the current product, and fixing issues, with a focus on internal tools/development.</li><li>Manage and support client technical integration projects and configuration updates.</li><li>Work cross-functionally with the engineering and product team to resolve product issues and enhance the quality of the product.</li><li>Take a deeper dive into client-reported issues when necessary, supporting client services and software engineering.</li><li>Provide feedback and analysis to our internal product development team on enhancements &amp; improvements to the product.</li><li>Document and maintain an internal knowledge base.</li></ul><p><strong>Minimum Qualifications</strong></p><ul><li>Bachelor's degree in Computer Science</li><li>Must have work authorization in USA</li></ul><p><strong>Preferred Qualifications</strong></p><ul><li>Demonstrated software engineering experience from previous internships or work experience.</li><li>Experience coding with Java; Front-end experience with Angular.</li><li>Strong technical aptitude and willingness to learn new applications and software tools.</li><li>Experience with SQL queries and front-end web development skills (HTML, JavaScript).</li><li>Knowledge of RESTful web services and experience with APIs.</li><li>Desire to contribute to major changes and enhancements in collaboration with the engineering team.</li><li>Strong planning, organization, &amp; communication skills.</li></ul><p>&nbsp;</p><p>CENTRL’s platform helps banks, financial institutions, asset owners, managers and other companies with risk oversight. We believe that people do their best in a culture that encourages teamwork, innovation, and inclusion. These values serve as the foundation of our culture, which is collaborative, dynamic, fast-paced, and drives our obsession in delighting our clients.</p><p>We live and breathe these values every day. And together, we’re committed to help solve real business challenges with CENTRL technology.</p><p>CENTRL is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws. This policy applies to all employment practices within our organization, including hiring, recruiting, promotion, termination, layoff, recall, leave of absence, compensation, benefits, training, and apprenticeship. CENTRL makes hiring decisions based solely on qualifications, merit, and business needs at the time.</p>",
  "id": "10472625"
}