{
  "title": "Python Backend Developer",
  "company": "Pure Tree Solutions LLC",
  "description": "<p><strong>Responsibilities:</strong></p><p>Design, develop, and maintain backend systems and APIs using Python (Django, FastAPI, Flask).</p><p>Build and expose robust RESTful or GraphQL endpoints for frontend and third-party integrations.</p><p>Design and optimize database schemas, write efficient queries, and ensure data integrity (PostgreSQL, MySQL, MongoDB, Redis).</p><p>Implement asynchronous tasks, message queues, or event-driven architectures when needed.</p><p>Ensure code quality through testing, reviews, and adherence to best practices.</p><p>Optimize backend performance, scalability, reliability, and security (caching, indexing, monitoring).</p><p>Collaborate with frontend, DevOps, QA, and product teams to translate business needs into technical solutions.</p><p>Manage version control (Git), CI/CD pipelines, containerization (Docker, Kubernetes), and cloud infrastructure (AWS, GCP, Azure).</p><p>Troubleshoot and debug production issues; perform root-cause analysis and corrective actions.</p><p><strong>Required Qualifications:</strong></p><p>Bachelor’s degree (or equivalent) in Computer Science, Software Engineering, or related field.</p><p><strong>5+ years of experience</strong> in Python development or a similar backend engineering role.</p><p>Strong proficiency in Python (3.x), object-oriented design, data structures, and algorithms.</p><p>Experience with one or more web frameworks (Django, FastAPI, Flask).</p><p>Solid experience with relational databases (PostgreSQL, MySQL) and ORM tools.</p><p>Familiarity with RESTful or GraphQL APIs and web protocols (HTTP, JSON).</p><p>Experience with Git, collaborative workflows, and CI/CD pipelines.</p><p>Demonstrated ability to write clean, maintainable, efficient, and well-tested code.</p><p>Strong communication and teamwork skills.</p><p>&nbsp;</p><p>Follow us and text us on linkedin with your resume: <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.linkedin.com/company/pure-tree-solutions/\">https://www.linkedin.com/company/pure-tree-solutions/</a><br><br>Our email: hr@puretreesolutions.com</p>",
  "id": "10471287"
}