{
  "title": "Python Intern",
  "company": "Infrrd, Inc",
  "description": "<p>Hello there!&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.infrrd.ai/\">Infrrd</a>&nbsp;here.</p><p>Haven’t heard of us before? No problem. First off, it’s pronounced In-fur-d.</p><p>Infrrd is a leading AI-powered Intelligent Document Processing (IDP) company that helps enterprises automate complex document-centric processes using proprietary machine learning and computer vision models. Our platform enables global enterprises to unlock valuable insights from unstructured data at scale, driving efficiency, compliance, and better decision-making.<br>&nbsp;</p><p>And now, we are on the lookout for a Python Intern to provide hands-on technical support during onboarding and product implementation for new customers, with a focus on rapid debugging, scripting, and data analysis.&nbsp;<br>&nbsp;</p><p><strong>Key Responsibilities:</strong></p><p>&nbsp;• Understand and document end-to-end onboarding flows and integration touchpoints.<br>• Debug and fix product configuration, scripting, and data issues during onboarding.<br>• Write quick scripts or utilities (Python preferred) to validate, transform, or analyze data.<br>• Leverage LLMs and AI tools (e.g., GitHub Copilot, ChatGPT, Cursor) to speed up tasks.<br>• Support development teams by triaging incoming bugs, logs, or support tickets.<br>• Document commonly faced issues and create repeatable troubleshooting guides.<br>• Collaborate with Product Managers and CSMs to gather customer requirements and implement quick-fixes or configuration changes.<br>• Assist in UAT testing and validation before go-live.<br>• Monitor onboarding health metrics (e.g., completion % of modules, error rates, etc.).</p><p>&nbsp;</p><p>In short,&nbsp;This role will play a critical role in ensuring smooth integrations, helping scale customer support, and improving developer productivity using AI-first tools and automation.</p><p>For more details, feel free to visit us at&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.infrrd.ai/\">https://www.infrrd.ai/</a>.&nbsp;</p><p>&nbsp;</p><ul><li>The internship will last between 5 to 6 months, and you will be required to attend the office on a daily basis.</li><li>For this role, we're looking for someone who can start right away.&nbsp;&nbsp;&nbsp;</li></ul><p>&nbsp;</p><p><strong>Job Location: San Jose</strong><br>&nbsp;</p><p>Looking forward to meeting you.</p>",
  "id": "10509864"
}