{
  "title": "Software Engineer Cloud/ Java",
  "company": "Archer",
  "description": "<p><strong><u>RSA - Software Engineer - Cloud/ Java</u></strong></p><p><strong>Location:</strong> Boston, MA (U.S. Citizen Required)<br><strong>Domain:</strong> Identity and Access Management (IAM), Security</p><p>&nbsp;</p><p>RSA provides trusted identity and access management&nbsp;for 12,000 organizations around the world, managing 25 million enterprise identities and providing secure, convenient access to millions of users. RSA&nbsp;specializes in empowering security-first organizations in financial services, healthcare, energy, technology services, and other industries to thrive in a digital world, delivering complete capabilities for modern authentication, access, lifecycle management, and identity governance. Whether in the cloud or on-premises,&nbsp;RSA&nbsp;connects people with the digital resources they depend on everywhere they live, work, and play.</p><p>&nbsp;</p><p>For decades, RSA has pioneered many of the encryption, authentication, and identity federation technologies that still power the internet. And now RSA is transforming the industry yet again, paving the way for the future of digital identity through the RSA Unified Identity Platform; next-generation hybrid and cloud solutions; the first ever and only multi-functional, passwordless hardware authenticator; and a frictionless, mobile-optimized experience for the modern workforce. If you are self-motivated and looking for a fast-paced challenge doing something that truly matters, come join our winning team!&nbsp; For more information, go to rsa.com.</p><p>&nbsp;</p><p>RSA is seeking a <strong>Software Engineer Cloud/ Java</strong> to contribute to the development and maintenance of our <strong>RSA ID Plus cloud-native SaaS platform</strong>. You will work with a team of engineers to implement features, fix bugs, and support the reliability and security of our SaaS Identity and Access Management services.</p><p>&nbsp;</p><p>This role is ideal for engineers who want to grow their technical skills while contributing to a high-performing, collaborative team building enterprise-grade SaaS solutions.</p><p>&nbsp;</p><p><strong><u>Responsibilities &amp; Qualifications:</u></strong></p><p><strong><u>Experience &amp; Required Skills:</u></strong></p><ul><li>2–5 years of experience developing object-oriented software, including a solid background in <strong>Java</strong>.</li><li>Experience with <strong>cloud-native development</strong> and familiarity with SaaS applications is a plus.</li><li>Ability to write clean, maintainable, and well-tested code.</li><li>Understanding of <strong>scalability, throughput, and basic reliability concepts</strong> in distributed systems.</li><li>Exposure to <strong>CI/CD pipelines</strong> and automated build/test processes.</li><li>Familiarity with <strong>containerization</strong> (Docker) and cloud platforms (AWS, Azure) is a plus.</li><li>Basic knowledge of <strong>secure coding practices</strong> and IAM/security concepts.</li><li>Strong problem-solving skills and ability to work collaboratively in a team.</li><li>Effective written and verbal communication skills.</li><li>U.S. Citizenship required</li></ul><p><strong><u>Education:</u></strong></p><ul><li>Bachelor’s degree in <strong>Computer Science</strong>, <strong>Engineering</strong>, or equivalent technical field required.</li></ul><p><strong><u>Preferred Skills:</u></strong></p><ul><li>Experience with <strong>Spring Framework / Spring Boot</strong>.</li><li>Exposure to relational (SQL Server, MySQL) or NoSQL databases.</li><li>Familiarity with directories (Active Directory, OpenLDAP).</li><li>Knowledge of front-end frameworks (React, Angular, or similar) is a plus.</li><li>Experience in <strong>Agile software development environments</strong>.</li></ul><p>&nbsp;</p><p>&nbsp;<i>RSA is committed to the principle of equal employment opportunity for all employees and applicants for employment and to providing employees with a work environment free of discrimination and harassment. All employment decisions at RSA are based on business needs, job requirements and individual qualifications, without regard to race, color, religion, national origin, sex (including pregnancy), age, disability, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, protected veteran status, genetic information, or any other characteristic protected by federal, state or local laws. RSA will not tolerate discrimination or harassment based on any of these characteristics. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. All RSA employees are expected to support this policy and contribute to an environment of equal opportunity.</i></p><p>&nbsp;</p><p>If you need a reasonable accommodation during the application process, please contact <a href=\"mailto:rsa.global.talent.acquisition@rsa.com\"><i><strong>rsa.global.talent.acquisition@rsa.com</strong></i></a>. All employees must be legally authorized to work in the US. RSA and its approved consultants will never ask you for a fee to process or consider your application for a career with RSA. RSA reserves the right to amend or withdraw any job posting at any time, including prior to the advertised closing date.</p><p>&nbsp;</p><p>RSA employees are eligible to participate in company-sponsored contributory health and welfare and 401(k) benefit plan.</p><p>&nbsp;</p><p>Non-commission RSA employees are eligible for annual discretionary bonuses.</p><p>&nbsp;</p><p>Pay Range: 70k - 160k</p>",
  "id": "10483734"
}