{
  "title": "Software Developer (Java experience)",
  "company": "Yakshna Solutions, Inc.",
  "description": "<p><strong>Position Title: Software Developer (JavaScript, ASP.NET, C#)</strong></p><p><strong>Job Id: 20220908&nbsp;</strong></p><p><strong>Location: Washington, DC - Onsite</strong></p><p>Yakshna Solutions, Inc., (YSI) is a CMMI Level 3 assessed, ISO 9001, 20000:1, 27001 certified, woman-owned small business enterprises, headquartered in Herndon, Virginia, USA. YSI provides professional IT solutions and services to business corporations and government organizations. YSI is committed to serve its business communities as a leading IT vendor providing innovative, quality, and cost-effective IT business solutions and services.&nbsp;</p><p>YSI provides a competitive benefits package that includes the following: 401(k), health, dental, and vision insurance, Life insurance, short-term and long-term disability insurance, paid time off, training, and professional development assistance.&nbsp;</p><p>YSI is seeking a highly qualified Software Developer for Long term Defense Client. The selected candidate will be able to communicate effectively (written/verbal), possess strong interpersonal skills, be self-motivated, and be innovative in a fast-paced environment.&nbsp;</p><p><strong>Required Qualifications and Skills:</strong><br>• Developing solutions using Microsoft Platforms i.e., <strong>ASP.NET, C#, SQL Server</strong> with a minimum eight (8) years’ experience.<br>• Experience in web service, Python, Sql, Xml.<br>• Should have 5 years’ experience in Web development and Application development.<br>• Experience with various technologies and protocols such as <strong><u>JavaScript</u></strong>, Angular, JSON, XML, SOAP, HTTPS, REST, and Typescript, HTML, CSS.<br>• Experience working in Agile Cross Functional Team.<br>• Should have demonstrated experience on Representational State Transfer (REST API) Services, Internet Information Services (IIS), Bootstrap, Backbone<br>• Bachelors or master’s in computer science or relevant filed.<br><strong>• Must have Top Secret Clearance</strong><br><strong>• Security+ certification required.</strong></p>",
  "id": "10489294"
}