{
  "title": "Software Engineering Intern",
  "company": "Crunchy Tech",
  "description": "<p><strong>Software Engineering Intern - Spring 2026 (Crunchy Tech)</strong>&nbsp;</p><p>Crunchy Tech is looking for a driven and talented&nbsp;<strong>Computer Science</strong>&nbsp;or&nbsp;<strong>Computer Engineering</strong>&nbsp;student to join our team for a one-semester internship during the&nbsp;<strong>Spring 2026</strong>&nbsp;term. This is an excellent opportunity for a student in their&nbsp;<strong>junior</strong>&nbsp;or&nbsp;<strong>senior</strong>&nbsp;year to gain hands-on experience in a fast-paced, innovative tech environment.&nbsp;</p><p>&nbsp;</p><p><strong>About Crunchy Tech</strong>&nbsp;</p><p>We are a leading technology firm specializing in B2B Audio Visual (AV) Solutions. At Crunchy Tech, we value innovation, collaboration, and continuous learning. Our interns are an essential part of our team, working on real-world projects that impactour products and customers.&nbsp;</p><p>&nbsp;</p><p><strong>Position Details</strong>&nbsp;</p><p><strong>Role:</strong>&nbsp;Software Engineering Intern&nbsp;</p><p><strong>Duration:</strong>&nbsp;One Academic Semester (Spring 2026)&nbsp;</p><p><strong>Location:</strong>&nbsp;Remote&nbsp;</p><p><strong>Compensation:</strong>&nbsp;Hourly pay commensurate with experience and technical skill level&nbsp;</p><p>&nbsp;</p><p><strong>What You'll Do</strong>&nbsp;</p><p>As a Software Engineering Intern, you will be embedded within one of our core development teams. Your responsibilities may include:&nbsp;</p><p><strong>Contributing</strong>&nbsp;to the design, development, and testing of new features for our core applications.&nbsp;</p><p><strong>Writing</strong>&nbsp;clean, efficient, and well-documented code.&nbsp;</p><p><strong>Debugging</strong>&nbsp;and resolving issues in existing codebases.&nbsp;</p><p><strong>Participating</strong>&nbsp;in code reviews and team stand-up meetings.&nbsp;</p><p><strong>Collaborating</strong>&nbsp;with internal teams to define technical requirements.&nbsp;</p><p>&nbsp;</p><p><strong>Qualifications</strong>&nbsp;</p><p><i><strong>Required</strong>&nbsp;</i></p><p>Currently pursuing a Bachelor's degree in&nbsp;<strong>Computer Science</strong>,&nbsp;<strong>Computer Engineering</strong>, or a closely related technical field.&nbsp;</p><p>Must be entering your&nbsp;<strong>Junior</strong>&nbsp;or&nbsp;<strong>Senior</strong>&nbsp;year in Spring 2026.&nbsp;</p><p>Strong foundation in&nbsp;<strong>data structures</strong>,&nbsp;<strong>algorithms</strong>, and&nbsp;<strong>object-oriented programming (OOP)</strong>&nbsp;principles.&nbsp;</p><p>Experience with at least one major programming language (e.g., Python, C++, Java).&nbsp;</p><p>Excellent problem-solving skills and a strong desire to learn.&nbsp;</p><p><i><strong>Preferred (Bonus Points!)</strong>&nbsp;</i></p><p>Experience with cloud platforms (e.g., AWS, Azure, Google Cloud, Zoho).&nbsp;</p><p>Prior experience with version control systems, especially&nbsp;<strong>Git</strong>.&nbsp;</p><p>Familiarity with agile development methodologies.&nbsp;</p><p>A personal project, open-source contribution, or substantial coursework demonstrating coding proficiency.&nbsp;</p><p>&nbsp;</p><p><strong>How to Apply</strong>&nbsp;</p><p>Please submit your resume, transcript (unofficial is acceptable), and a brief cover letter explaining your interest in Crunchy Tech and your relevant coursework/projects.&nbsp;</p><p><strong>Application Deadline:</strong>&nbsp;January 15th 2026&nbsp;</p><p>Crunchy Tech is an Equal Opportunity Employer. We encourage applications from all qualified individuals.&nbsp;</p><p>&nbsp;</p><p><strong>Ready to crunch some code with us? Apply today!</strong>&nbsp;</p>",
  "id": "10496109"
}