{
  "title": "Software Engineer Intern",
  "company": "Daycos, Inc.",
  "description": "<p>The Software Engineer aspect of the position is responsible for designing and implementing powerful, highly scalable, and reliable products and services.</p><p><i>Software Engineer responsibilities may include:</i></p><ul><li>Design, develop, and implement software packages.</li><li>Troubleshoot, debug, and resolve issues with web-based applications, websites, and mobile applications.</li><li>Translate functional specifications into logical, component-based technical designs.</li><li>Proactively identify and build effective solutions to solve complex technical problems.</li><li>Collaborate with team members to understand product vision and requirements; execute against plan to deliver high quality software on schedule.</li></ul><p>The Software Quality Assurance (QA) aspect of the position is responsible for effectively contributing to our test framework and services.</p><p><i>Software Quality Assurance responsibilities may include:</i></p><ul><li>Actively participate in group technology reviews to critique the work of self and others.</li><li>Have an understanding and knowledge of performance and application testing.</li><li>Anticipate and prevent problems and roadblocks, before they occur, and present technical issues and their impact.</li></ul><p><i>Desired skills:</i></p><ul><li>A general knowledge of standard software engineering concepts, practices, and procedures</li><li>Construct, call and architect Rest Services and Web API’s</li><li>Java, C# or C++ and object-oriented concepts</li><li>Various software development technologies and frameworks such as HTML, JavaScript, CSS, JSON, XML, Svelte, graphql, node.js and python</li><li>A general understanding of databases</li></ul><p>During this internship, Daycos will give the intern position hands-on business experience in their field of study. This may include working on actual real-time business tasks in their position, attending standup meetings with the team they will be working on, as well as project meetings for a specific project or service their team is working on. The intern will be paired with a mentor to work alongside with throughout the duration of their internship.</p><p>Learn more about Daycos:</p><ul><li>www.daycos.com/internship</li><li>https://www.youtube.com/watch?v=_iiyJVzET1c</li></ul>",
  "id": "10478539"
}