{
  "title": "Software Engineer Developer (JR-0001876)",
  "company": "Health Research, Inc.",
  "description": "<p><strong>Responsibilities</strong></p><p>The Software Engineer/Developer will support the existing applications and workflows and provide support toward the designing, development, and maintenance of a modern solution that leverages the cloud computing platform in support of the Public Health Infrastructure grant deliverables. The incumbent will support building scalable, reliable and efficient cloud-based and modern solutions for Vital Records. Responsibilities include contributing to the development and maintenance of cloud-native applications using programming languages like Python, Java or JavaScript. The incumbent will support application development tasks including programming solutions, writing and executing unit test plans, researching, resolving, and testing defects, and customer technical support. The incumbent will contribute to developing appropriate documentation in work assignments such as documentation in code repositories and technical design documents. The incumbent will participate in the release management process including technical steps to promote, test and release through the development environment, coordinating with infrastructure staff; other appropriate related duties as assigned.</p><p><strong>Minimum Qualifications</strong></p><p>Bachelor’s degree in Computer Science or Information Technology; OR an Associate’s degree in a related field and two years of computer programming, database design/development, or systems analysis; OR four years of such experience.</p><p><strong>Preferred Qualifications</strong></p><p>At least three years of experience with a cloud-based data warehousing platform. Experience with ETL development and developing applications that interact with cloud-based APIs to access and manage data. At least two years of experience with scripting languages, such as Python, JavaScript, Groovy, Ruby, or Perl. At least two years of experience with SQL.</p><p>&nbsp;</p><p><strong>Conditions of Employment</strong></p><p>Grant funded position. Compliance with funding requirements such as time and effort reporting, grant deliverables, and contract deliverables, is required.&nbsp;Valid and unrestricted authorization to work in the U.S. is required. Visa sponsorship is not available for this position.&nbsp; Travel up to 10% of the time will be required.&nbsp; The selected candidate must reside within a reasonable commuting distance of the official work location specified in the job posting and must also be located in or willing to relocate to one of the following states: New York, New Jersey, Connecticut, Vermont, or Massachusetts, prior to hire. Telecommuting will be available.&nbsp;<br>HRI participates in the E-Verify Program.&nbsp;&nbsp;&nbsp;</p><p>Affirmative Action/Equal Opportunity Employer/Qualified Individuals with Disabilities/Qualified Protected Veterans</p><p>www.healthresearch.org</p><p><strong><u>About Health Research, Inc.</u></strong></p><p><strong>Join us in our mission to make a difference in public health and advance scientific research! At Health Research, Inc. (HRI), your work will contribute to meaningful change and innovation in the communities we serve! At HRI, we are on a mission to transform the health and well-being of the people of New York State through innovative partnerships and cutting-edge public health initiatives. As a dynamic non-profit organization, HRI&nbsp;plays a crucial role in advancing the strategic goals of the New York State Department of Health (DOH), Roswell Park Comprehensive Cancer Center (RPCCC), and other health-related entities.</strong></p><p><strong>HRI offers a robust, comprehensive benefits package to eligible employees, including:</strong></p><ul><li><strong>Health, dental and vision insurance -</strong>&nbsp;Several comprehensive health insurance plans to choose from;&nbsp; <strong>Flexible benefit accounts -</strong>&nbsp;Medical, dependent care, adoption assistance, parking and transit;&nbsp; <strong>Generous paid time off -</strong>&nbsp;Paid federal and state holidays, paid sick, vacation and personal leave;&nbsp; <strong>Tuition support -</strong>&nbsp;Assistance is available for individuals pursuing educational or training opportunities;&nbsp; <strong>Retirement Benefits -</strong>&nbsp;HRI is a participating employer in the New York State and Local Retirement System and offers optional enrollment in the New York State Deferred Compensation Plan. HRI provides a postretirement Health Benefits Plan for qualified retirees to use towards health insurance premiums and eligible medical expenses;&nbsp; &nbsp; &nbsp; &nbsp;<strong>Employee Assistance Program -</strong>&nbsp;Provides educational and wellness programs, training, and 24/7 confidential services to assist employees, both personally and professionally;&nbsp; <strong>And so much more!</strong></li></ul><p>&nbsp;</p><p>&nbsp;</p>",
  "id": "10488939"
}