{
  "title": "Software Engineer Intern",
  "company": "NRG Energy",
  "description": "<p>Summary: The Mobile App Vertical team within the Vivint Innovation Center is looking for a Software Engineering Intern who wants to learn to develop and maintain code related to customer-facing mobile applications powered by Vivint’s Smart Home devices. This internship is open to android or iOS engineers. We’re a fast-paced and multi-functional team of skilled developers with a passion for innovation, delivering value, and solving hard problems. We deliver mobile application features that enable our customers to access and make use of their smart home, and the devices which power it, in new and exciting ways.</p><p>Primary Responsibilities:</p><p>· Learn about our system architecture and the architecture within your specific codebase</p><p>· Contribute to new feature development, maintenance, and architectural activities</p><p>· Collaborate closely with software engineers representing other disciplines (like backend , mobile, and embedded software).</p><p>· Participate in peer code reviews</p><p>· Work in a fast-paced, self-directed, agile environment</p><p>· Participate in our mobile guild with fellow engineers to develop better organization-wide development practices and solve hard problems</p><p>&nbsp;</p><p>Recommended Skills:</p><p>An interest in the following:</p><p>· Mobile app development</p><p>· API design</p><p>· RESTful services</p><p>· Bug Tracking and Source control (JIRA, Bitbucket, Git)</p><p>· Common software architectural practices and principles (MVC, MVP, MVVM, Clean, SOLID)</p><p>· Refactoring and Unit Testing</p><p>&nbsp;</p><p>Required Education/Experience:</p><p>· Course work towards BS Computer Science or related subject area</p><p>· Exposure to programming languages such as Java</p><p>· Ability to triage issues, react well to changes, work with teams and ability to multi-task</p><p>· Solid verbal/written communication</p><p>· Organized and excited about technology!</p>",
  "id": "10489088"
}