{
  "title": "Software Engineer",
  "company": "Halogion",
  "description": "<p><strong>Send an email to stephaniemaryna.trafford@halogion.com with the Subject “Software Engineer (Codebase Deep Reasoning &amp; Evaluation)” showing your interest in the role to get priority consideration.</strong></p><p>At Halogion, we are an Independent member of Mercor referral partner program. We refer candidates to our partner that collaborates with world’s leading AI research labs to build and train cutting-edge AI models</p><p><br>We are seeking software engineers to support one of the world’s leading AI labs in advancing code understanding and reasoning capabilities for next-generation machine learning models.</p><p>In this role, you’ll engage in real-world engineering work: analyzing large, production-grade repositories to create and evaluate technically challenging coding questions. You’ll systematically explore multiple modules, connect related functions across files, and assess how advanced AI systems reason about architecture, data flow, and performance.</p><p>Your ability to reason from evidence: citing specific files, functions, and line numbers will directly influence how these AI models learn to think like expert engineers.</p><p><strong>⸻</strong></p><p><strong>You’re a Great Fit If You</strong></p><p>• <strong>Have 4+ years of elite software engineering experience</strong> at top-tier startups, quantitative trading firms, hedge funds, or similar high-performance environments.</p><p>• Have experience using coding agents or LLMs as part of your engineering workflow (e.g., Copilot, Claude, GPT-4, or Replit Agents).</p><p>• Hold a Computer Science degree from a leading university or equivalent practical expertise.</p><p>• <strong>Are fluent in Python and JavaScript/TypeScript</strong>, and can comfortably read Java, Go, or other modern languages (Rust, C++, C#).</p><p>• Demonstrate systematic exploration, you examine multiple files and dependencies before forming conclusions.</p><p>• Practice evidence-based reasoning, grounding your answers in specific code references rather than assumptions.</p><p>• <strong>Excel at cross-file synthesis</strong>, connecting distributed logic to explain how systems work end-to-end.</p><p>• Show strong architectural understanding, identifying patterns, abstractions, and design choices in complex codebases.</p><p>• Display intellectual honesty: you acknowledge uncertainty when information is incomplete or ambiguous.</p><p>• Write clear, structured technical documentation, and communicate insights precisely and persuasively.</p><p>⸻</p><p><strong>Example Projects &amp; Domains</strong></p><p>You may work across diverse systems, including:</p><p>• Web APIs and backend services</p><p>• CLI tools and data processing pipelines</p><p>• Frontend applications and DevOps tooling</p><p>• Security, observability, and performance-critical architectures</p><p>Each task will challenge your ability to connect architecture, dependencies, and logic across real-world repositories.</p>",
  "id": "10507716"
}