{
  "title": "Software Engineer Intern (Winter/Spring 2026)",
  "company": "Arctex Inc.",
  "description": "<p><strong>About Us:</strong> &nbsp;Arctex is a software development company specializing in software as a service (SaaS) products. We are creating CollegeAppAssist.com, a platform that lets students fill out college &amp; scholarship applications in one click.</p><p>&nbsp;</p><p><strong>All applicants are eligible to receive a FREE Pro subscription to CollegeAppAssist. Use code “apply2026” on sign up: </strong><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://collegeappassist.com\"><strong>https://collegeappassist.com</strong></a></p><p>(We recommend signing up to get an idea of what you would be working on.)</p><p>&nbsp;</p><p>Frontend Tech Stack: React, JavaScript, Tailwind, Chrome Extension API, Git, GitHub</p><p>Backend Tech Stack: Express, Node, JavaScript, MongoDB, Stripe API, Google OAuth, Docker, Git, GitHub</p><p>&nbsp;</p><p><strong>Responsibilities</strong></p><p>As a software engineer intern, potential responsibilities include:</p><ul><li>Write clean, efficient, and maintainable code using industry best practices and coding standards.</li><li>Analyze user needs and software requirements to design solutions and implement them effectively.</li><li>Document code consistently throughout the development process and produce comprehensive documentation for reference.</li><li>Work closely with developers, designers, and product managers to deliver high-quality software solutions and ensure software functionality and reliability.</li><li>Communicate effectively with team members to share ideas, discuss technical issues, and provide updates on project progress.</li></ul><p>&nbsp;</p><p><strong>Qualifications</strong></p><ul><li>Experience with one or more programming languages/frameworks listed above.</li><li>Familiarity with version control systems (Git &amp; GitHub).</li><li>Comfortable working remotely and asynchronously for 10-20 hours a week.</li><li>Ability to work independently and in a team environment, being open to receiving assistance from others.</li><li>Strong problem-solving skills and attention to detail.</li></ul><p>&nbsp;</p><p><strong>Things we offer:</strong></p><ul><li>Remote/Work From Home</li><li>Flexible &amp; asynchronous work hours.</li><li>Collaborative and supportive work environment</li><li>Opportunity to work on real-world projects and gain hands-on experience.</li><li>Commitment to career development and training</li><li>Cash Stipend<br>&nbsp;</li></ul><p>The interview process is one interview and we will NOT ask you a LeetCode question. It will revolve around software development topics and behavioral questions.</p>",
  "id": "10498385"
}