{
  "title": "Software Engineer",
  "company": "BetterBasket",
  "description": "<p><strong>Why not BetterBasket?</strong></p><p>&nbsp;</p><p>We don’t believe in wasting your time. Here are some reasons you should not apply:</p><p>&nbsp;</p><ul><li>You are looking for a manager to be told what to do - how to fix a bug, the right approach for a problem, what’s next for your career. You will be accountable for your own work, but what is possible will be bound only by your ambition, ideas, and the $800bn grocery industry.</li><li>You want a job with work-life balance. Recharging is essential, but we’re working on such exciting projects at the frontier of retail and AI (which our customers can’t wait to use!) that we can’t stop thinking about our next sprint.</li><li>You question if things are “worth it” - if this job is worth the “opportunity cost” of a Big Tech salary, if grinding out a feature was worth a late night. You will be given everything needed to be comfortable and the upside of a founder, but we know exceptional things are only done with great sacrifice that compound over time.</li><li>You graduate in June - we are looking or an immediate starter in January 2026.</li></ul><p>&nbsp;</p><p><strong>What are you working on?</strong></p><p>&nbsp;</p><ul><li>BetterBasket is developing the first fully integrated pricing solution for grocers, coming from our founders’ experience launching Uber Eats’ global grocery delivery platform. We’re working on everything from pricing algorithms to digital price tags in order to create a revolutionary product to transform the $800bn grocery industry.</li><li>We’re already working with 4 top 100 grocers in North America on dynamic pricing and market data, and from day one you’ll be working closely with leaders and subject matter experts at our customers on their top priorities.</li><li>BetterBasket is backed by top investors like Y Combinator and Aito Capital as well as founders and C-suite executives at YouTube, Uber, Amazon, Tesco, and GoodRx.</li><li>Our work environment is collaborative and inclusive, fostering growth and learning. If you’re eager to be part of a fast-moving, innovative team that values your development, we want you on our team.</li></ul><p>&nbsp;</p><p><strong>What technologies do you use?</strong></p><p>&nbsp;</p><p>Core Competencies</p><ul><li>Python (ML libraries, concurrency)</li><li>HTTP/REST API</li><li>Javascript (Typescript, React, Node)</li><li>SQL (Locks, Stored Procedures)</li><li>Cloud / DevOps (Azure, Kubernetes, Docker, Redis)</li></ul><p>&nbsp;</p><p>Nice to Have</p><ul><li>Product design (Figma)</li><li>Inference at scale</li><li>Scraping (Scrapy, Selenium)</li><li>Wireless Communication Protocols</li></ul><p>&nbsp;</p><p><strong>What can I work on?</strong></p><p>BetterBasket is developing the first fully integrated pricing solution for grocers. Problems that you could work on as a hands-on founding engineer include but are not limited to:</p><p>&nbsp;</p><ul><li>How can we extract and classify data at scale from online stores towards a centralized product knowledge graph?</li><li>How can we maximize profits for a grocer by modeling competitive prices, historical sales data, elasticity estimates, and external variables?</li><li>How can price changes be triggered and performed automatically?</li><li>What’s the best way to summarize and present the results of our actions?</li></ul><p>&nbsp;</p><p><strong>What’s in it for me?</strong></p><p>&nbsp;</p><ul><li>Take ownership of products that will revolutionize the grocery industry</li><li>Collaborate with a tight-knit team of talented builders</li><li>Work closely with customers from day 1 and see the results of your work</li><li>Launch products that directly impact people’s lives</li><li>Work with the co-founders daily in-person in SF</li><li>Competitive salary, equity, health insurance</li></ul><p>&nbsp;</p><p>If you’ve gotten this far and our culture and tech resonate with you, we want you to apply.</p>",
  "id": "10506395"
}