{
  "title": "Teach For America Spring Ignite Fellow",
  "company": "Teach For America",
  "description": "<p><strong>Who We Are:&nbsp;</strong>&nbsp;</p><p>Teach For America is a national nonprofit that provides college students and recent graduates paid, public service pathways to jumpstart their careers. Through our Teach For America Ignite program, we offer paid, virtual tutoring opportunities that give college students the chance to build career-ready skills in communication, problem-solving, lesson planning, and group facilitation while contributing to stronger learning outcomes and deep relationships with K-12 students in underserved communities. The fellowship is offered for both fall and spring semesters.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>What You’ll Do:</strong>&nbsp;</p><ul><li>Instruct and mentor a small group of 2-3 K-12 students&nbsp;&nbsp;</li><li>Tutor virtually&nbsp;</li><li>Work 3-5 hours per week for a term (14 weeks):&nbsp;&nbsp;</li><li>Weeks 1 + 2: Build your skills through onboarding&nbsp;&nbsp;</li><li>Weeks 3-14: Partner directly with a small group of students&nbsp;&nbsp;</li><li>Build relationships and foster belonging with kids&nbsp;&nbsp;</li><li>Accelerate learning in in elementary reading, middle school math, or high school post-secondary access&nbsp;&nbsp;</li><li>Receive training and support from expert teachers&nbsp;</li><li>Earn a financial award for your semester of service&nbsp;</li></ul><p>&nbsp;</p><p><strong>Spring Application Deadline:</strong>&nbsp; November 19, 2025&nbsp;</p><p><strong>Start Date:</strong> January 20, 2026&nbsp;</p><p>&nbsp;</p><p><strong>Apply at</strong>: <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://tfaignite.smapply.io/saml2/login/\"><u>https://tfaignite.smapply.io/saml2/login/</u></a>&nbsp;&nbsp;</p><p>&nbsp;<br><strong>Who’s This For:</strong>&nbsp;</p><p>TFA Ignite looks for driven college students seeking a paid, public service opportunity to grow professionally during the school year. They are ready to show up consistently for students — prepared, on-time, and ready to lead by example. TFA Ignite is for growing leaders who have:&nbsp;&nbsp;</p><ul><li>A deep belief in expanding opportunity and excellent education for all kids&nbsp;</li><li>The ability to set clear goals and create meaningful change&nbsp;</li><li>Effective collaboration skills with people from different backgrounds and perspectives&nbsp;</li><li>A desire to learn from people, experiences, and self-reflection&nbsp;</li></ul><p>No matter your college major or job experience, Teach For America helps you develop career-ready skills in communication, problem-solving, lesson planning, and group facilitation while building strong relationships with students that make an impact right away!&nbsp;</p><p>&nbsp;</p><p><strong>Minimum Requirements:</strong>&nbsp;</p><ul><li>At least 18 years old&nbsp;</li><li>2.5 cumulative Undergrad GPA or higher&nbsp;</li><li>Able to work approximately 5 hours a week throughout the semester (~3 tutoring, ~2 prep)&nbsp;</li><li>Current undergraduate or graduate student in Spring 2026, former Ignite fellow or Teach For America alum&nbsp;</li><li>Must be a citizen, national, or legal resident of the United States, <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.teachforamerica.org/applying-to-tfa/applying-as-an-immigrant-or-refugee\"><u>EAD holder</u></a> or have DACA status&nbsp;</li><li>Uphold Teach For America’s commitment to people, community, and pursuing opportunity for all&nbsp;</li></ul><p><strong>Applicants do not need a background in education. All experience levels, majors, and backgrounds are welcome to apply</strong>&nbsp;</p><p>&nbsp;</p><p><strong>What You’ll Gain:</strong>&nbsp;</p><ul><li>Ongoing training and coaching from experienced teachers to help students succeed&nbsp;</li><li>Resume-worthy experience in facilitation, adaptability, and people leadership&nbsp;</li><li>Skills to use in any field including (but not limited to) communication, empathy, problem-solving, and leadership skills&nbsp;</li><li>Early access to future TFA opportunities, like the 2-Year Corps, if you decide you want to continue working in education.&nbsp;</li><li>A chance to impact lives, including your own&nbsp;</li></ul><p>&nbsp;</p><p><strong>Program Benefits:</strong>&nbsp;</p><ul><li>Fully virtual — no commute, no relocation&nbsp;</li><li>Weekly time commitment: 3–5 hours&nbsp;</li><li>Earn a financial award at the end of each semester, ranging from $800-$1,100 in the fall and $1000-$1,400 in the spring&nbsp;</li><li>Additional $100 for perfect attendance and $100 for returning fellows&nbsp;</li><li>Receive financial award via direct deposit as a lump sum, pre-tax after completing your Fellowship commitment&nbsp;</li><li>Designed to fit into a typical college schedule (comparable to a 1-credit course)&nbsp;</li></ul><p>&nbsp;</p><p><strong>What’s next:&nbsp;</strong>&nbsp;</p><p>Apply for Teach For America Ignite! Build your skills and do work that matters in a way that fits your schedule and helps you explore what’s next. It’s a consistent commitment, but one that fits into your semester — a clear, meaningful way to contribute now, and explore whether working in education might be part of your path forward. To apply or learn more, visit <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.teachforamerica.org/ignite-fellowship\"><u>https://www.teachforamerica.org/ignite-fellowship</u></a>.&nbsp;</p>",
  "id": "10151382"
}